<a href="https://colab.research.google.com/github/ikfaisal/dsia/blob/master/DSIA_Lab_2_1_3_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 2.1.3: 
# *Database Programming with Python and SQLite*

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and databse maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands". 

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [1]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [39]:
c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

In [40]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitution using the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [41]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command

c.execute('INSERT INTO houses VALUES (?,?,?,?,?)', last_sale)

# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [42]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;

c.executemany('INSERT INTO houses VALUES (?,?,?,?,?)', recent_sales)
# this is a security measure against SQL injection attacks:
# 

conn.commit()

Select all rows from houses

In [43]:
# A

c.execute('SELECT * FROM houses').fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000)]




#### Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

In [44]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:
data = genfromtxt('housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [45]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [46]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [47]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.executemany('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', data)

conn.commit()

In [48]:
c.execute('SELECT * FROM houses').fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000),
 (5, 2104, 3, 70, 399900),
 (6, 1600, 3, 28, 329900),
 (7, 2400, 3, 44, 369000),
 (8, 1416, 2, 49, 232000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (11, 1534, 3, 12, 314900),
 (12, 1427, 3, 57, 198999),
 (13, 1380, 3, 14, 212000),
 (14, 1494, 3, 15, 242500),
 (15, 1940, 4, 7, 239999),
 (16, 2000, 3, 27, 347000),
 (17, 1890, 3, 45, 329999),
 (18, 4478, 5, 49, 699900),
 (19, 1268, 3, 58, 259900),
 (20, 2300, 4, 77, 449900),
 (21, 1320, 2, 62, 299900),
 (22, 1236, 3, 78, 199900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (25, 1767, 3, 44, 252900),
 (26, 1888, 2, 79, 255000),
 (27, 1604, 3, 13, 242900),
 (28, 1962, 4, 53, 259900),
 (29, 3890, 3, 36, 573900),
 (30, 1100, 3, 60, 249900),
 (31, 1458, 3, 29, 464500),
 (32, 2526, 3, 13, 469000),
 (33, 2200, 3, 28, 475000),
 (34, 2637, 3, 25, 299900),
 (35, 1839, 2, 40, 349900),
 (36, 1000, 1, 5, 169900),
 (37, 2040, 4, 75, 314900),
 (38, 3137, 3, 67, 579900),
 (39, 1811, 4, 24, 285900),
 (40, 1437, 3, 50, 249900),
 (41, 1239, 3, 22, 229900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (45, 1664, 2, 40, 368500),
 (46, 2238, 3, 37, 329900),
 (47, 2567, 4, 57, 314000),
 (48, 1200, 3, 76, 299000),
 (49, 852, 2, 70, 179900),
 (50, 1852, 4, 64, 299900),
 (51, 1203, 3, 11, 239500),
 (52, 2104, 3, 70, 399900),
 (53, 1600, 3, 28, 329900),
 (54, 2400, 3, 44, 369000),
 (55, 1416, 2, 49, 232000),
 (56, 3000, 4, 75, 539900),
 (57, 1985, 4, 61, 299900),
 (58, 1534, 3, 12, 314900),
 (59, 1427, 3, 57, 198999),
 (60, 1380, 3, 14, 212000),
 (61, 1494, 3, 15, 242500),
 (62, 1940, 4, 7, 239999),
 (63, 2000, 3, 27, 347000),
 (64, 1890, 3, 45, 329999),
 (65, 4478, 5, 49, 699900),
 (66, 1268, 3, 58, 259900),
 (67, 2300, 4, 77, 449900),
 (68, 1320, 2, 62, 299900),
 (69, 1236, 3, 78, 199900),
 (70, 2609, 4, 5, 499998),
 (71, 3031, 4, 21, 599000),
 (72, 1767, 3, 44, 252900),
 (73, 1888, 2, 79, 255000),
 (74, 1604, 3, 13, 242900),
 (75, 1962, 4, 53, 259900),
 (76, 3890, 3, 36, 573900),
 (77, 1100, 3, 60, 249900),
 (78, 1458, 3, 29, 464500),
 (79, 2526, 3, 13, 469000),
 (80, 2200, 3, 28, 475000),
 (81, 2637, 3, 25, 299900),
 (82, 1839, 2, 40, 349900),
 (83, 1000, 1, 5, 169900),
 (84, 2040, 4, 75, 314900),
 (85, 3137, 3, 67, 579900),
 (86, 1811, 4, 24, 285900),
 (87, 1437, 3, 50, 249900),
 (88, 1239, 3, 22, 229900),
 (89, 2132, 4, 28, 345000),
 (90, 4215, 4, 66, 549000),
 (91, 2162, 4, 43, 287000),
 (92, 1664, 2, 40, 368500),
 (93, 2238, 3, 37, 329900),
 (94, 2567, 4, 57, 314000),
 (95, 1200, 3, 76, 299000),
 (96, 852, 2, 70, 179900),
 (97, 1852, 4, 64, 299900),
 (98, 1203, 3, 11, 239500),
 (99, 2104, 3, 70, 399900),
 (100, 1600, 3, 28, 329900),
 (101, 2400, 3, 44, 369000),
 (102, 1416, 2, 49, 232000),
 (103, 3000, 4, 75, 539900),
 (104, 1985, 4, 61, 299900),
 (105, 1534, 3, 12, 314900),
 (106, 1427, 3, 57, 198999),
 (107, 1380, 3, 14, 212000),
 (108, 1494, 3, 15, 242500),
 (109, 1940, 4, 7, 239999),
 (110, 2000, 3, 27, 347000),
 (111, 1890, 3, 45, 329999),
 (112, 4478, 5, 49, 699900),
 (113, 1268, 3, 58, 259900),
 (114, 2300, 4, 77, 449900),
 (115, 1320, 2, 62, 299900),
 (116, 1236, 3, 78, 199900),
 (117, 2609, 4, 5, 499998),
 (118, 3031, 4, 21, 599000),
 (119, 1767, 3, 44, 252900),
 (120, 1888, 2, 79, 255000),
 (121, 1604, 3, 13, 242900),
 (122, 1962, 4, 53, 259900),
 (123, 3890, 3, 36, 573900),
 (124, 1100, 3, 60, 249900),
 (125, 1458, 3, 29, 464500),
 (126, 2526, 3, 13, 469000),
 (127, 2200, 3, 28, 475000),
 (128, 2637, 3, 25, 299900),
 (129, 1839, 2, 40, 349900),
 (130, 1000, 1, 5, 169900),
 (131, 2040, 4, 75, 314900),
 (132, 3137, 3, 67, 579900),
 (133, 1811, 4, 24, 285900),
 (134, 1437, 3, 50, 249900),
 (135, 1239, 3, 22, 229900),
 (136, 2132, 4, 28, 345000),
 (137, 4215, 4, 66, 549000),
 (138, 2162, 4, 43, 287000),
 (139, 1664, 2, 40, 368500),
 (140, 2238, 3, 37, 329900),
 (141, 2567, 4, 57, 314000),
 (142, 1200, 3, 76, 299000),
 (143, 852, 2, 70, 179900),
 (144, 1852, 4, 64, 299900),
 (145, 1203, 3, 11, 239500),
 (146, 2104, 3, 70, 399900),
 (147, 1600, 3, 28, 329900),
 (148, 2400, 3, 44, 369000),
 (149, 1416, 2, 49, 232000),
 (150, 3000, 4, 75, 539900),
 (151, 1985, 4, 61, 299900),
 (152, 1534, 3, 12, 314900),
 (153, 1427, 3, 57, 198999),
 (154, 1380, 3, 14, 212000),
 (155, 1494, 3, 15, 242500),
 (156, 1940, 4, 7, 239999),
 (157, 2000, 3, 27, 347000),
 (158, 1890, 3, 45, 329999),
 (159, 4478, 5, 49, 699900),
 (160, 1268, 3, 58, 259900),
 (161, 2300, 4, 77, 449900),
 (162, 1320, 2, 62, 299900),
 (163, 1236, 3, 78, 199900),
 (164, 2609, 4, 5, 499998),
 (165, 3031, 4, 21, 599000),
 (166, 1767, 3, 44, 252900),
 (167, 1888, 2, 79, 255000),
 (168, 1604, 3, 13, 242900),
 (169, 1962, 4, 53, 259900),
 (170, 3890, 3, 36, 573900),
 (171, 1100, 3, 60, 249900),
 (172, 1458, 3, 29, 464500),
 (173, 2526, 3, 13, 469000),
 (174, 2200, 3, 28, 475000),
 (175, 2637, 3, 25, 299900),
 (176, 1839, 2, 40, 349900),
 (177, 1000, 1, 5, 169900),
 (178, 2040, 4, 75, 314900),
 (179, 3137, 3, 67, 579900),
 (180, 1811, 4, 24, 285900),
 (181, 1437, 3, 50, 249900),
 (182, 1239, 3, 22, 229900),
 (183, 2132, 4, 28, 345000),
 (184, 4215, 4, 66, 549000),
 (185, 2162, 4, 43, 287000),
 (186, 1664, 2, 40, 368500),
 (187, 2238, 3, 37, 329900),
 (188, 2567, 4, 57, 314000),
 (189, 1200, 3, 76, 299000),
 (190, 852, 2, 70, 179900),
 (191, 1852, 4, 64, 299900),
 (192, 1203, 3, 11, 239500),
 (193, 2104, 3, 70, 399900),
 (194, 1600, 3, 28, 329900),
 (195, 2400, 3, 44, 369000),
 (196, 1416, 2, 49, 232000),
 (197, 3000, 4, 75, 539900),
 (198, 1985, 4, 61, 299900),
 (199, 1534, 3, 12, 314900),
 (200, 1427, 3, 57, 198999),
 (201, 1380, 3, 14, 212000),
 (202, 1494, 3, 15, 242500),
 (203, 1940, 4, 7, 239999),
 (204, 2000, 3, 27, 347000),
 (205, 1890, 3, 45, 329999),
 (206, 4478, 5, 49, 699900),
 (207, 1268, 3, 58, 259900),
 (208, 2300, 4, 77, 449900),
 (209, 1320, 2, 62, 299900),
 (210, 1236, 3, 78, 199900),
 (211, 2609, 4, 5, 499998),
 (212, 3031, 4, 21, 599000),
 (213, 1767, 3, 44, 252900),
 (214, 1888, 2, 79, 255000),
 (215, 1604, 3, 13, 242900),
 (216, 1962, 4, 53, 259900),
 (217, 3890, 3, 36, 573900),
 (218, 1100, 3, 60, 249900),
 (219, 1458, 3, 29, 464500),
 (220, 2526, 3, 13, 469000),
 (221, 2200, 3, 28, 475000),
 (222, 2637, 3, 25, 299900),
 (223, 1839, 2, 40, 349900),
 (224, 1000, 1, 5, 169900),
 (225, 2040, 4, 75, 314900),
 (226, 3137, 3, 67, 579900),
 (227, 1811, 4, 24, 285900),
 (228, 1437, 3, 50, 249900),
 (229, 1239, 3, 22, 229900),
 (230, 2132, 4, 28, 345000),
 (231, 4215, 4, 66, 549000),
 (232, 2162, 4, 43, 287000),
 (233, 1664, 2, 40, 368500),
 (234, 2238, 3, 37, 329900),
 (235, 2567, 4, 57, 314000),
 (236, 1200, 3, 76, 299000),
 (237, 852, 2, 70, 179900),
 (238, 1852, 4, 64, 299900),
 (239, 1203, 3, 11, 239500),
 (240, 2104, 3, 70, 399900),
 (241, 1600, 3, 28, 329900),
 (242, 2400, 3, 44, 369000),
 (243, 1416, 2, 49, 232000),
 (244, 3000, 4, 75, 539900),
 (245, 1985, 4, 61, 299900),
 (246, 1534, 3, 12, 314900),
 (247, 1427, 3, 57, 198999),
 (248, 1380, 3, 14, 212000),
 (249, 1494, 3, 15, 242500),
 (250, 1940, 4, 7, 239999),
 (251, 2000, 3, 27, 347000),
 (252, 1890, 3, 45, 329999),
 (253, 4478, 5, 49, 699900),
 (254, 1268, 3, 58, 259900),
 (255, 2300, 4, 77, 449900),
 (256, 1320, 2, 62, 299900),
 (257, 1236, 3, 78, 199900),
 (258, 2609, 4, 5, 499998),
 (259, 3031, 4, 21, 599000),
 (260, 1767, 3, 44, 252900),
 (261, 1888, 2, 79, 255000),
 (262, 1604, 3, 13, 242900),
 (263, 1962, 4, 53, 259900),
 (264, 3890, 3, 36, 573900),
 (265, 1100, 3, 60, 249900),
 (266, 1458, 3, 29, 464500),
 (267, 2526, 3, 13, 469000),
 (268, 2200, 3, 28, 475000),
 (269, 2637, 3, 25, 299900),
 (270, 1839, 2, 40, 349900),
 (271, 1000, 1, 5, 169900),
 (272, 2040, 4, 75, 314900),
 (273, 3137, 3, 67, 579900),
 (274, 1811, 4, 24, 285900),
 (275, 1437, 3, 50, 249900),
 (276, 1239, 3, 22, 229900),
 (277, 2132, 4, 28, 345000),
 (278, 4215, 4, 66, 549000),
 (279, 2162, 4, 43, 287000),
 (280, 1664, 2, 40, 368500),
 (281, 2238, 3, 37, 329900),
 (282, 2567, 4, 57, 314000),
 (283, 1200, 3, 76, 299000),
 (284, 852, 2, 70, 179900),
 (285, 1852, 4, 64, 299900),
 (286, 1203, 3, 11, 239500),
 (287, 2104, 3, 70, 399900),
 (288, 1600, 3, 28, 329900),
 (289, 2400, 3, 44, 369000),
 (290, 1416, 2, 49, 232000),
 (291, 3000, 4, 75, 539900),
 (292, 1985, 4, 61, 299900),
 (293, 1534, 3, 12, 314900),
 (294, 1427, 3, 57, 198999),
 (295, 1380, 3, 14, 212000),
 (296, 1494, 3, 15, 242500),
 (297, 1940, 4, 7, 239999),
 (298, 2000, 3, 27, 347000),
 (299, 1890, 3, 45, 329999),
 (300, 4478, 5, 49, 699900),
 (301, 1268, 3, 58, 259900),
 (302, 2300, 4, 77, 449900),
 (303, 1320, 2, 62, 299900),
 (304, 1236, 3, 78, 199900),
 (305, 2609, 4, 5, 499998),
 (306, 3031, 4, 21, 599000),
 (307, 1767, 3, 44, 252900),
 (308, 1888, 2, 79, 255000),
 (309, 1604, 3, 13, 242900),
 (310, 1962, 4, 53, 259900),
 (311, 3890, 3, 36, 573900),
 (312, 1100, 3, 60, 249900),
 (313, 1458, 3, 29, 464500),
 (314, 2526, 3, 13, 469000),
 (315, 2200, 3, 28, 475000),
 (316, 2637, 3, 25, 299900),
 (317, 1839, 2, 40, 349900),
 (318, 1000, 1, 5, 169900),
 (319, 2040, 4, 75, 314900),
 (320, 3137, 3, 67, 579900),
 (321, 1811, 4, 24, 285900),
 (322, 1437, 3, 50, 249900),
 (323, 1239, 3, 22, 229900),
 (324, 2132, 4, 28, 345000),
 (325, 4215, 4, 66, 549000),
 (326, 2162, 4, 43, 287000),
 (327, 1664, 2, 40, 368500),
 (328, 2238, 3, 37, 329900),
 (329, 2567, 4, 57, 314000),
 (330, 1200, 3, 76, 299000),
 (331, 852, 2, 70, 179900),
 (332, 1852, 4, 64, 299900),
 (333, 1203, 3, 11, 239500),
 (334, 2104, 3, 70, 399900),
 (335, 1600, 3, 28, 329900),
 (336, 2400, 3, 44, 369000),
 (337, 1416, 2, 49, 232000),
 (338, 3000, 4, 75, 539900),
 (339, 1985, 4, 61, 299900),
 (340, 1534, 3, 12, 314900),
 (341, 1427, 3, 57, 198999),
 (342, 1380, 3, 14, 212000),
 (343, 1494, 3, 15, 242500),
 (344, 1940, 4, 7, 239999),
 (345, 2000, 3, 27, 347000),
 (346, 1890, 3, 45, 329999),
 (347, 4478, 5, 49, 699900),
 (348, 1268, 3, 58, 259900),
 (349, 2300, 4, 77, 449900),
 (350, 1320, 2, 62, 299900),
 (351, 1236, 3, 78, 199900),
 (352, 2609, 4, 5, 499998),
 (353, 3031, 4, 21, 599000),
 (354, 1767, 3, 44, 252900),
 (355, 1888, 2, 79, 255000),
 (356, 1604, 3, 13, 242900),
 (357, 1962, 4, 53, 259900),
 (358, 3890, 3, 36, 573900),
 (359, 1100, 3, 60, 249900),
 (360, 1458, 3, 29, 464500),
 (361, 2526, 3, 13, 469000),
 (362, 2200, 3, 28, 475000),
 (363, 2637, 3, 25, 299900),
 (364, 1839, 2, 40, 349900),
 (365, 1000, 1, 5, 169900),
 (366, 2040, 4, 75, 314900),
 (367, 3137, 3, 67, 579900),
 (368, 1811, 4, 24, 285900),
 (369, 1437, 3, 50, 249900),
 (370, 1239, 3, 22, 229900),
 (371, 2132, 4, 28, 345000),
 (372, 4215, 4, 66, 549000),
 (373, 2162, 4, 43, 287000),
 (374, 1664, 2, 40, 368500),
 (375, 2238, 3, 37, 329900),
 (376, 2567, 4, 57, 314000),
 (377, 1200, 3, 76, 299000),
 (378, 852, 2, 70, 179900),
 (379, 1852, 4, 64, 299900),
 (380, 1203, 3, 11, 239500),
 (381, 2104, 3, 70, 399900),
 (382, 1600, 3, 28, 329900),
 (383, 2400, 3, 44, 369000),
 (384, 1416, 2, 49, 232000),
 (385, 3000, 4, 75, 539900),
 (386, 1985, 4, 61, 299900),
 (387, 1534, 3, 12, 314900),
 (388, 1427, 3, 57, 198999),
 (389, 1380, 3, 14, 212000),
 (390, 1494, 3, 15, 242500),
 (391, 1940, 4, 7, 239999),
 (392, 2000, 3, 27, 347000),
 (393, 1890, 3, 45, 329999),
 (394, 4478, 5, 49, 699900),
 (395, 1268, 3, 58, 259900),
 (396, 2300, 4, 77, 449900),
 (397, 1320, 2, 62, 299900),
 (398, 1236, 3, 78, 199900),
 (399, 2609, 4, 5, 499998),
 (400, 3031, 4, 21, 599000),
 (401, 1767, 3, 44, 252900),
 (402, 1888, 2, 79, 255000),
 (403, 1604, 3, 13, 242900),
 (404, 1962, 4, 53, 259900),
 (405, 3890, 3, 36, 573900),
 (406, 1100, 3, 60, 249900),
 (407, 1458, 3, 29, 464500),
 (408, 2526, 3, 13, 469000),
 (409, 2200, 3, 28, 475000),
 (410, 2637, 3, 25, 299900),
 (411, 1839, 2, 40, 349900),
 (412, 1000, 1, 5, 169900),
 (413, 2040, 4, 75, 314900),
 (414, 3137, 3, 67, 579900),
 (415, 1811, 4, 24, 285900),
 (416, 1437, 3, 50, 249900),
 (417, 1239, 3, 22, 229900),
 (418, 2132, 4, 28, 345000),
 (419, 4215, 4, 66, 549000),
 (420, 2162, 4, 43, 287000),
 (421, 1664, 2, 40, 368500),
 (422, 2238, 3, 37, 329900),
 (423, 2567, 4, 57, 314000),
 (424, 1200, 3, 76, 299000),
 (425, 852, 2, 70, 179900),
 (426, 1852, 4, 64, 299900),
 (427, 1203, 3, 11, 239500),
 (428, 2104, 3, 70, 399900),
 (429, 1600, 3, 28, 329900),
 (430, 2400, 3, 44, 369000),
 (431, 1416, 2, 49, 232000),
 (432, 3000, 4, 75, 539900),
 (433, 1985, 4, 61, 299900),
 (434, 1534, 3, 12, 314900),
 (435, 1427, 3, 57, 198999),
 (436, 1380, 3, 14, 212000),
 (437, 1494, 3, 15, 242500),
 (438, 1940, 4, 7, 239999),
 (439, 2000, 3, 27, 347000),
 (440, 1890, 3, 45, 329999),
 (441, 4478, 5, 49, 699900),
 (442, 1268, 3, 58, 259900),
 (443, 2300, 4, 77, 449900),
 (444, 1320, 2, 62, 299900),
 (445, 1236, 3, 78, 199900),
 (446, 2609, 4, 5, 499998),
 (447, 3031, 4, 21, 599000),
 (448, 1767, 3, 44, 252900),
 (449, 1888, 2, 79, 255000),
 (450, 1604, 3, 13, 242900),
 (451, 1962, 4, 53, 259900),
 (452, 3890, 3, 36, 573900),
 (453, 1100, 3, 60, 249900),
 (454, 1458, 3, 29, 464500),
 (455, 2526, 3, 13, 469000),
 (456, 2200, 3, 28, 475000),
 (457, 2637, 3, 25, 299900),
 (458, 1839, 2, 40, 349900),
 (459, 1000, 1, 5, 169900),
 (460, 2040, 4, 75, 314900),
 (461, 3137, 3, 67, 579900),
 (462, 1811, 4, 24, 285900),
 (463, 1437, 3, 50, 249900),
 (464, 1239, 3, 22, 229900),
 (465, 2132, 4, 28, 345000),
 (466, 4215, 4, 66, 549000),
 (467, 2162, 4, 43, 287000),
 (468, 1664, 2, 40, 368500),
 (469, 2238, 3, 37, 329900),
 (470, 2567, 4, 57, 314000),
 (471, 1200, 3, 76, 299000),
 (472, 852, 2, 70, 179900),
 (473, 1852, 4, 64, 299900),
 (474, 1203, 3, 11, 239500),
 (475, 2104, 3, 70, 399900),
 (476, 1600, 3, 28, 329900),
 (477, 2400, 3, 44, 369000),
 (478, 1416, 2, 49, 232000),
 (479, 3000, 4, 75, 539900),
 (480, 1985, 4, 61, 299900),
 (481, 1534, 3, 12, 314900),
 (482, 1427, 3, 57, 198999),
 (483, 1380, 3, 14, 212000),
 (484, 1494, 3, 15, 242500),
 (485, 1940, 4, 7, 239999),
 (486, 2000, 3, 27, 347000),
 (487, 1890, 3, 45, 329999),
 (488, 4478, 5, 49, 699900),
 (489, 1268, 3, 58, 259900),
 (490, 2300, 4, 77, 449900),
 (491, 1320, 2, 62, 299900),
 (492, 1236, 3, 78, 199900),
 (493, 2609, 4, 5, 499998),
 (494, 3031, 4, 21, 599000),
 (495, 1767, 3, 44, 252900),
 (496, 1888, 2, 79, 255000),
 (497, 1604, 3, 13, 242900),
 (498, 1962, 4, 53, 259900),
 (499, 3890, 3, 36, 573900),
 (500, 1100, 3, 60, 249900),
 (501, 1458, 3, 29, 464500),
 (502, 2526, 3, 13, 469000),
 (503, 2200, 3, 28, 475000),
 (504, 2637, 3, 25, 299900),
 (505, 1839, 2, 40, 349900),
 (506, 1000, 1, 5, 169900),
 (507, 2040, 4, 75, 314900),
 (508, 3137, 3, 67, 579900),
 (509, 1811, 4, 24, 285900),
 (510, 1437, 3, 50, 249900),
 (511, 1239, 3, 22, 229900),
 (512, 2132, 4, 28, 345000),
 (513, 4215, 4, 66, 549000),
 (514, 2162, 4, 43, 287000),
 (515, 1664, 2, 40, 368500),
 (516, 2238, 3, 37, 329900),
 (517, 2567, 4, 57, 314000),
 (518, 1200, 3, 76, 299000),
 (519, 852, 2, 70, 179900),
 (520, 1852, 4, 64, 299900),
 (521, 1203, 3, 11, 239500),
 (522, 2104, 3, 70, 399900),
 (523, 1600, 3, 28, 329900),
 (524, 2400, 3, 44, 369000),
 (525, 1416, 2, 49, 232000),
 (526, 3000, 4, 75, 539900),
 (527, 1985, 4, 61, 299900),
 (528, 1534, 3, 12, 314900),
 (529, 1427, 3, 57, 198999),
 (530, 1380, 3, 14, 212000),
 (531, 1494, 3, 15, 242500),
 (532, 1940, 4, 7, 239999),
 (533, 2000, 3, 27, 347000),
 (534, 1890, 3, 45, 329999),
 (535, 4478, 5, 49, 699900),
 (536, 1268, 3, 58, 259900),
 (537, 2300, 4, 77, 449900),
 (538, 1320, 2, 62, 299900),
 (539, 1236, 3, 78, 199900),
 (540, 2609, 4, 5, 499998),
 (541, 3031, 4, 21, 599000),
 (542, 1767, 3, 44, 252900),
 (543, 1888, 2, 79, 255000),
 (544, 1604, 3, 13, 242900),
 (545, 1962, 4, 53, 259900),
 (546, 3890, 3, 36, 573900),
 (547, 1100, 3, 60, 249900),
 (548, 1458, 3, 29, 464500),
 (549, 2526, 3, 13, 469000),
 (550, 2200, 3, 28, 475000),
 (551, 2637, 3, 25, 299900),
 (552, 1839, 2, 40, 349900),
 (553, 1000, 1, 5, 169900),
 (554, 2040, 4, 75, 314900),
 (555, 3137, 3, 67, 579900),
 (556, 1811, 4, 24, 285900),
 (557, 1437, 3, 50, 249900),
 (558, 1239, 3, 22, 229900),
 (559, 2132, 4, 28, 345000),
 (560, 4215, 4, 66, 549000),
 (561, 2162, 4, 43, 287000),
 (562, 1664, 2, 40, 368500),
 (563, 2238, 3, 37, 329900),
 (564, 2567, 4, 57, 314000),
 (565, 1200, 3, 76, 299000),
 (566, 852, 2, 70, 179900),
 (567, 1852, 4, 64, 299900),
 (568, 1203, 3, 11, 239500),
 (569, 2104, 3, 70, 399900),
 (570, 1600, 3, 28, 329900),
 (571, 2400, 3, 44, 369000),
 (572, 1416, 2, 49, 232000),
 (573, 3000, 4, 75, 539900),
 (574, 1985, 4, 61, 299900),
 (575, 1534, 3, 12, 314900),
 (576, 1427, 3, 57, 198999),
 (577, 1380, 3, 14, 212000),
 (578, 1494, 3, 15, 242500),
 (579, 1940, 4, 7, 239999),
 (580, 2000, 3, 27, 347000),
 (581, 1890, 3, 45, 329999),
 (582, 4478, 5, 49, 699900),
 (583, 1268, 3, 58, 259900),
 (584, 2300, 4, 77, 449900),
 (585, 1320, 2, 62, 299900),
 (586, 1236, 3, 78, 199900),
 (587, 2609, 4, 5, 499998),
 (588, 3031, 4, 21, 599000),
 (589, 1767, 3, 44, 252900),
 (590, 1888, 2, 79, 255000),
 (591, 1604, 3, 13, 242900),
 (592, 1962, 4, 53, 259900),
 (593, 3890, 3, 36, 573900),
 (594, 1100, 3, 60, 249900),
 (595, 1458, 3, 29, 464500),
 (596, 2526, 3, 13, 469000),
 (597, 2200, 3, 28, 475000),
 (598, 2637, 3, 25, 299900),
 (599, 1839, 2, 40, 349900),
 (600, 1000, 1, 5, 169900),
 (601, 2040, 4, 75, 314900),
 (602, 3137, 3, 67, 579900),
 (603, 1811, 4, 24, 285900),
 (604, 1437, 3, 50, 249900),
 (605, 1239, 3, 22, 229900),
 (606, 2132, 4, 28, 345000),
 (607, 4215, 4, 66, 549000),
 (608, 2162, 4, 43, 287000),
 (609, 1664, 2, 40, 368500),
 (610, 2238, 3, 37, 329900),
 (611, 2567, 4, 57, 314000),
 (612, 1200, 3, 76, 299000),
 (613, 852, 2, 70, 179900),
 (614, 1852, 4, 64, 299900),
 (615, 1203, 3, 11, 239500),
 (616, 2104, 3, 70, 399900),
 (617, 1600, 3, 28, 329900),
 (618, 2400, 3, 44, 369000),
 (619, 1416, 2, 49, 232000),
 (620, 3000, 4, 75, 539900),
 (621, 1985, 4, 61, 299900),
 (622, 1534, 3, 12, 314900),
 (623, 1427, 3, 57, 198999),
 (624, 1380, 3, 14, 212000),
 (625, 1494, 3, 15, 242500),
 (626, 1940, 4, 7, 239999),
 (627, 2000, 3, 27, 347000),
 (628, 1890, 3, 45, 329999),
 (629, 4478, 5, 49, 699900),
 (630, 1268, 3, 58, 259900),
 (631, 2300, 4, 77, 449900),
 (632, 1320, 2, 62, 299900),
 (633, 1236, 3, 78, 199900),
 (634, 2609, 4, 5, 499998),
 (635, 3031, 4, 21, 599000),
 (636, 1767, 3, 44, 252900),
 (637, 1888, 2, 79, 255000),
 (638, 1604, 3, 13, 242900),
 (639, 1962, 4, 53, 259900),
 (640, 3890, 3, 36, 573900),
 (641, 1100, 3, 60, 249900),
 (642, 1458, 3, 29, 464500),
 (643, 2526, 3, 13, 469000),
 (644, 2200, 3, 28, 475000),
 (645, 2637, 3, 25, 299900),
 (646, 1839, 2, 40, 349900),
 (647, 1000, 1, 5, 169900),
 (648, 2040, 4, 75, 314900),
 (649, 3137, 3, 67, 579900),
 (650, 1811, 4, 24, 285900),
 (651, 1437, 3, 50, 249900),
 (652, 1239, 3, 22, 229900),
 (653, 2132, 4, 28, 345000),
 (654, 4215, 4, 66, 549000),
 (655, 2162, 4, 43, 287000),
 (656, 1664, 2, 40, 368500),
 (657, 2238, 3, 37, 329900),
 (658, 2567, 4, 57, 314000),
 (659, 1200, 3, 76, 299000),
 (660, 852, 2, 70, 179900),
 (661, 1852, 4, 64, 299900),
 (662, 1203, 3, 11, 239500),
 (663, 2104, 3, 70, 399900),
 (664, 1600, 3, 28, 329900),
 (665, 2400, 3, 44, 369000),
 (666, 1416, 2, 49, 232000),
 (667, 3000, 4, 75, 539900),
 (668, 1985, 4, 61, 299900),
 (669, 1534, 3, 12, 314900),
 (670, 1427, 3, 57, 198999),
 (671, 1380, 3, 14, 212000),
 (672, 1494, 3, 15, 242500),
 (673, 1940, 4, 7, 239999),
 (674, 2000, 3, 27, 347000),
 (675, 1890, 3, 45, 329999),
 (676, 4478, 5, 49, 699900),
 (677, 1268, 3, 58, 259900),
 (678, 2300, 4, 77, 449900),
 (679, 1320, 2, 62, 299900),
 (680, 1236, 3, 78, 199900),
 (681, 2609, 4, 5, 499998),
 (682, 3031, 4, 21, 599000),
 (683, 1767, 3, 44, 252900),
 (684, 1888, 2, 79, 255000),
 (685, 1604, 3, 13, 242900),
 (686, 1962, 4, 53, 259900),
 (687, 3890, 3, 36, 573900),
 (688, 1100, 3, 60, 249900),
 (689, 1458, 3, 29, 464500),
 (690, 2526, 3, 13, 469000),
 (691, 2200, 3, 28, 475000),
 (692, 2637, 3, 25, 299900),
 (693, 1839, 2, 40, 349900),
 (694, 1000, 1, 5, 169900),
 (695, 2040, 4, 75, 314900),

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [49]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [50]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

This would delete the whole tabe. DANGER!!!!!

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

In [63]:
# ANSWER

c.execute('SELECT * FROM houses WHERE Bdrms = 4').fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900),
 (56, 3000, 4, 75, 539900),
 (57, 1985, 4, 61, 299900),
 (62, 1940, 4, 7, 239999),
 (67, 2300, 4, 77, 449900),
 (70, 2609, 4, 5, 499998),
 (71, 3031, 4, 21, 599000),
 (75, 1962, 4, 53, 259900),
 (84, 2040, 4, 75, 314900),
 (86, 1811, 4, 24, 285900),
 (89, 2132, 4, 28, 345000),
 (90, 4215, 4, 66, 549000),
 (91, 2162, 4, 43, 287000),
 (94, 2567, 4, 57, 314000),
 (97, 1852, 4, 64, 299900),
 (103, 3000, 4, 75, 539900),
 (104, 1985, 4, 61, 299900),
 (109, 1940, 4, 7, 239999),
 (114, 2300, 4, 77, 449900),
 (117, 2609, 4, 5, 499998),
 (118, 3031, 4, 21, 599000),
 (122, 1962, 4, 53, 259900),
 (131, 2040, 4, 75, 314900),
 (133, 1811, 4, 24, 285900),
 (136, 2132, 4, 28, 345000),
 (137, 4215, 4, 66, 549000),
 (138, 2162, 4, 43, 287000),
 (141, 2567, 4, 57, 314000),
 (144, 1852, 4, 64, 299900),
 (150, 3000, 4, 75, 539900),
 (151, 1985, 4, 61, 299900),
 (156, 1940, 4, 7, 239999),
 (161, 2300, 4, 77, 449900),
 (164, 2609, 4, 5, 499998),
 (165, 3031, 4, 21, 599000),
 (169, 1962, 4, 53, 259900),
 (178, 2040, 4, 75, 314900),
 (180, 1811, 4, 24, 285900),
 (183, 2132, 4, 28, 345000),
 (184, 4215, 4, 66, 549000),
 (185, 2162, 4, 43, 287000),
 (188, 2567, 4, 57, 314000),
 (191, 1852, 4, 64, 299900),
 (197, 3000, 4, 75, 539900),
 (198, 1985, 4, 61, 299900),
 (203, 1940, 4, 7, 239999),
 (208, 2300, 4, 77, 449900),
 (211, 2609, 4, 5, 499998),
 (212, 3031, 4, 21, 599000),
 (216, 1962, 4, 53, 259900),
 (225, 2040, 4, 75, 314900),
 (227, 1811, 4, 24, 285900),
 (230, 2132, 4, 28, 345000),
 (231, 4215, 4, 66, 549000),
 (232, 2162, 4, 43, 287000),
 (235, 2567, 4, 57, 314000),
 (238, 1852, 4, 64, 299900),
 (244, 3000, 4, 75, 539900),
 (245, 1985, 4, 61, 299900),
 (250, 1940, 4, 7, 239999),
 (255, 2300, 4, 77, 449900),
 (258, 2609, 4, 5, 499998),
 (259, 3031, 4, 21, 599000),
 (263, 1962, 4, 53, 259900),
 (272, 2040, 4, 75, 314900),
 (274, 1811, 4, 24, 285900),
 (277, 2132, 4, 28, 345000),
 (278, 4215, 4, 66, 549000),
 (279, 2162, 4, 43, 287000),
 (282, 2567, 4, 57, 314000),
 (285, 1852, 4, 64, 299900),
 (291, 3000, 4, 75, 539900),
 (292, 1985, 4, 61, 299900),
 (297, 1940, 4, 7, 239999),
 (302, 2300, 4, 77, 449900),
 (305, 2609, 4, 5, 499998),
 (306, 3031, 4, 21, 599000),
 (310, 1962, 4, 53, 259900),
 (319, 2040, 4, 75, 314900),
 (321, 1811, 4, 24, 285900),
 (324, 2132, 4, 28, 345000),
 (325, 4215, 4, 66, 549000),
 (326, 2162, 4, 43, 287000),
 (329, 2567, 4, 57, 314000),
 (332, 1852, 4, 64, 299900),
 (338, 3000, 4, 75, 539900),
 (339, 1985, 4, 61, 299900),
 (344, 1940, 4, 7, 239999),
 (349, 2300, 4, 77, 449900),
 (352, 2609, 4, 5, 499998),
 (353, 3031, 4, 21, 599000),
 (357, 1962, 4, 53, 259900),
 (366, 2040, 4, 75, 314900),
 (368, 1811, 4, 24, 285900),
 (371, 2132, 4, 28, 345000),
 (372, 4215, 4, 66, 549000),
 (373, 2162, 4, 43, 287000),
 (376, 2567, 4, 57, 314000),
 (379, 1852, 4, 64, 299900),
 (385, 3000, 4, 75, 539900),
 (386, 1985, 4, 61, 299900),
 (391, 1940, 4, 7, 239999),
 (396, 2300, 4, 77, 449900),
 (399, 2609, 4, 5, 499998),
 (400, 3031, 4, 21, 599000),
 (404, 1962, 4, 53, 259900),
 (413, 2040, 4, 75, 314900),
 (415, 1811, 4, 24, 285900),
 (418, 2132, 4, 28, 345000),
 (419, 4215, 4, 66, 549000),
 (420, 2162, 4, 43, 287000),
 (423, 2567, 4, 57, 314000),
 (426, 1852, 4, 64, 299900),
 (432, 3000, 4, 75, 539900),
 (433, 1985, 4, 61, 299900),
 (438, 1940, 4, 7, 239999),
 (443, 2300, 4, 77, 449900),
 (446, 2609, 4, 5, 499998),
 (447, 3031, 4, 21, 599000),
 (451, 1962, 4, 53, 259900),
 (460, 2040, 4, 75, 314900),
 (462, 1811, 4, 24, 285900),
 (465, 2132, 4, 28, 345000),
 (466, 4215, 4, 66, 549000),
 (467, 2162, 4, 43, 287000),
 (470, 2567, 4, 57, 314000),
 (473, 1852, 4, 64, 299900),
 (479, 3000, 4, 75, 539900),
 (480, 1985, 4, 61, 299900),
 (485, 1940, 4, 7, 239999),
 (490, 2300, 4, 77, 449900),
 (493, 2609, 4, 5, 499998),
 (494, 3031, 4, 21, 599000),
 (498, 1962, 4, 53, 259900),
 (507, 2040, 4, 75, 314900),
 (509, 1811, 4, 24, 285900),
 (512, 2132, 4, 28, 345000),
 (513, 4215, 4, 66, 549000),
 (514, 2162, 4, 43, 287000),
 (517, 2567, 4, 57, 314000),
 (520, 1852, 4, 64, 299900),
 (526, 3000, 4, 75, 539900),
 (527, 1985, 4, 61, 299900),
 (532, 1940, 4, 7, 239999),
 (537, 2300, 4, 77, 449900),
 (540, 2609, 4, 5, 499998),
 (541, 3031, 4, 21, 599000),
 (545, 1962, 4, 53, 259900),
 (554, 2040, 4, 75, 314900),
 (556, 1811, 4, 24, 285900),
 (559, 2132, 4, 28, 345000),
 (560, 4215, 4, 66, 549000),
 (561, 2162, 4, 43, 287000),
 (564, 2567, 4, 57, 314000),
 (567, 1852, 4, 64, 299900),
 (573, 3000, 4, 75, 539900),
 (574, 1985, 4, 61, 299900),
 (579, 1940, 4, 7, 239999),
 (584, 2300, 4, 77, 449900),
 (587, 2609, 4, 5, 499998),
 (588, 3031, 4, 21, 599000),
 (592, 1962, 4, 53, 259900),
 (601, 2040, 4, 75, 314900),
 (603, 1811, 4, 24, 285900),
 (606, 2132, 4, 28, 345000),
 (607, 4215, 4, 66, 549000),
 (608, 2162, 4, 43, 287000),
 (611, 2567, 4, 57, 314000),
 (614, 1852, 4, 64, 299900),
 (620, 3000, 4, 75, 539900),
 (621, 1985, 4, 61, 299900),
 (626, 1940, 4, 7, 239999),
 (631, 2300, 4, 77, 449900),
 (634, 2609, 4, 5, 499998),
 (635, 3031, 4, 21, 599000),
 (639, 1962, 4, 53, 259900),
 (648, 2040, 4, 75, 314900),
 (650, 1811, 4, 24, 285900),
 (653, 2132, 4, 28, 345000),
 (654, 4215, 4, 66, 549000),
 (655, 2162, 4, 43, 287000),
 (658, 2567, 4, 57, 314000),
 (661, 1852, 4, 64, 299900),
 (667, 3000, 4, 75, 539900),
 (668, 1985, 4, 61, 299900),
 (673, 1940, 4, 7, 239999),
 (678, 2300, 4, 77, 449900),
 (681, 2609, 4, 5, 499998),
 (682, 3031, 4, 21, 599000),
 (686, 1962, 4, 53, 259900),
 (695, 2040, 4, 75, 314900),
 (697, 1811, 4, 24, 285900),
 (700, 2132, 4, 28, 345000),
 (701, 4215, 4, 66, 549000),
 (702, 2162, 4, 43, 287000),
 (705, 2567, 4, 57, 314000),
 (708, 1852, 4, 64, 299900),
 (714, 3000, 4, 75, 539900),
 (715, 1985, 4, 61, 299900),
 (720, 1940, 4, 7, 239999),
 (725, 2300, 4, 77, 449900),
 (728, 2609, 4, 5, 499998),
 (729, 3031, 4, 21, 599000),
 (733, 1962, 4, 53, 259900),
 (742, 2040, 4, 75, 314900),
 (744, 1811, 4, 24, 285900),
 (747, 2132, 4, 28, 345000),
 (748, 4215, 4, 66, 549000),
 (749, 2162, 4, 43, 287000),
 (752, 2567, 4, 57, 314000),
 (755, 1852, 4, 64, 299900),
 (761, 3000, 4, 75, 539900),
 (762, 1985, 4, 61, 299900),
 (767, 1940, 4, 7, 239999),
 (772, 2300, 4, 77, 449900),
 (775, 2609, 4, 5, 499998),
 (776, 3031, 4, 21, 599000),
 (780, 1962, 4, 53, 259900),
 (789, 2040, 4, 75, 314900),
 (791, 1811, 4, 24, 285900),
 (794, 2132, 4, 28, 345000),
 (795, 4215, 4, 66, 549000),
 (796, 2162, 4, 43, 287000),
 (799, 2567, 4, 57, 314000),
 (802, 1852, 4, 64, 299900),
 (808, 3000, 4, 75, 539900),
 (809, 1985, 4, 61, 299900),
 (814, 1940, 4, 7, 239999),
 (819, 2300, 4, 77, 449900),
 (822, 2609, 4, 5, 499998),
 (823, 3031, 4, 21, 599000),
 (827, 1962, 4, 53, 259900),
 (836, 2040, 4, 75, 314900),
 (838, 1811, 4, 24, 285900),
 (841, 2132, 4, 28, 345000),
 (842, 4215, 4, 66, 549000),
 (843, 2162, 4, 43, 287000),
 (846, 2567, 4, 57, 314000),
 (849, 1852, 4, 64, 299900),
 (855, 3000, 4, 75, 539900),
 (856, 1985, 4, 61, 299900),
 (861, 1940, 4, 7, 239999),
 (866, 2300, 4, 77, 449900),
 (869, 2609, 4, 5, 499998),
 (870, 3031, 4, 21, 599000),
 (874, 1962, 4, 53, 259900),
 (883, 2040, 4, 75, 314900),
 (885, 1811, 4, 24, 285900),
 (888, 2132, 4, 28, 345000),
 (889, 4215, 4, 66, 549000),
 (890, 2162, 4, 43, 287000),
 (893, 2567, 4, 57, 314000),
 (896, 1852, 4, 64, 299900),
 (902, 3000, 4, 75, 539900),
 (903, 1985, 4, 61, 299900),
 (908, 1940, 4, 7, 239999),
 (913, 2300, 4, 77, 449900),
 (916, 2609, 4, 5, 499998),
 (917, 3031, 4, 21, 599000),
 (921, 1962, 4, 53, 259900),
 (930, 2040, 4, 75, 314900),
 (932, 1811, 4, 24, 285900),
 (935, 2132, 4, 28, 345000),
 (936, 4215, 4, 66, 549000),
 (937, 2162, 4, 43, 287000),
 (940, 2567, 4, 57, 314000),
 (943, 1852, 4, 64, 299900),
 (949, 3000, 4, 75, 539900),
 (950, 1985, 4, 61, 299900),
 (955, 1940, 4, 7, 239999),
 (960, 2300, 4, 77, 449900),
 (963, 2609, 4, 5, 499998),
 (964, 3031, 4, 21, 599000),
 (968, 1962, 4, 53, 259900),
 (977, 2040, 4, 75, 314900),
 (979, 1811, 4, 24, 285900),
 (982, 2132, 4, 28, 345000),
 (983, 4215, 4, 66, 549000),
 (984, 2162, 4, 43, 287000),
 (987, 2567, 4, 57, 314000),
 (990, 1852, 4, 64, 299900),
 (996, 3000, 4, 75, 539900),
 (997, 1985, 4, 61, 299900),
 (1002, 1940, 4, 7, 239999),
 (1007, 2300, 4, 77, 449900),
 (1010, 2609, 4, 5, 499998),
 (1011, 3031, 4, 21, 599000),
 (1015, 1962, 4, 53, 259900),
 (1024, 2040, 4, 75, 314900),
 (1026, 1811, 4, 24, 285900),
 (1029, 2132, 4, 28, 345000),
 (1030, 4215, 4, 66, 549000),
 (1031, 2162, 4, 43, 287000),
 (1034, 2567, 4, 57, 314000),
 (1037, 1852, 4, 64, 299900),
 (1043, 3000, 4, 75, 539900),
 (1044, 1985, 4, 61, 299900),
 (1049, 1940, 4, 7, 239999),
 (1054, 2300, 4, 77, 449900),
 (1057, 2609, 4, 5, 499998),
 (1058, 3031, 4, 21, 599000),
 (1062, 1962, 4, 53, 259900),
 (1071, 2040, 4, 75, 314900),
 (1073, 1811, 4, 24, 285900),
 (1076, 2132, 4, 28, 345000),
 (1077, 4215, 4, 66, 549000),
 (1078, 2162, 4, 43, 287000),
 (1081, 2567, 4, 57, 314000),
 (1084, 1852, 4, 64, 299900),
 (1090, 3000, 4, 75, 539900),
 (1091, 1985, 4, 61, 299900),
 (1096, 1940, 4, 7, 239999),
 (1101, 2300, 4, 77, 449900),
 (1104, 2609, 4, 5, 499998),
 (1105, 3031, 4, 21, 599000),
 (1109, 1962, 4, 53, 259900),
 (1118, 2040, 4, 75, 314900),
 (1120, 1811, 4, 24, 285900),
 (1123, 2132, 4, 28, 345000),
 (1124, 4215, 4, 66, 549000),
 (1125, 2162, 4, 43, 287000),
 (1128, 2567, 4, 57, 314000),
 (1131, 1852, 4, 64, 299900),
 (1137, 3000, 4, 75, 539900),
 (1138, 1985, 4, 61, 299900),
 (1143, 1940, 4, 7, 239999),
 (1148, 2300, 4, 77, 449900),
 (1151, 2609, 4, 5, 499998),
 (1152, 3031, 4, 21, 599000),
 (1156, 1962, 4, 53, 259900),
 (1165, 2040, 4, 75, 314900),
 (1167, 1811, 4, 24, 285900),
 (1170, 2132, 4, 28, 345000),
 (1171, 4215, 4, 66, 549000),
 (1172, 2162, 4, 43, 287000),
 (1175, 2567, 4, 57, 314000),
 (1178, 1852, 4, 64, 299900),
 (1184, 3000, 4, 75, 539900),
 (1185, 1985, 4, 61, 299900),
 (1190, 1940, 4, 7, 239999),
 (1195, 2300, 4, 77, 449900),
 (1198, 2609, 4, 5, 499998),
 (1199, 3031, 4, 21, 599000),
 (1203, 1962, 4, 53, 259900),
 (1212, 2040, 4, 75, 314900),
 (1214, 1811, 4, 24, 285900),
 (1217, 2132, 4, 28, 345000),
 (1218, 4215, 4, 66, 549000),
 (1219, 2162, 4, 43, 287000),
 (1222, 2567, 4, 57, 314000),
 (1225, 1852, 4, 64, 299900),
 (1231, 3000, 4, 75, 539900),
 (1232, 1985, 4, 61, 299900),
 (1237, 1940, 4, 7, 239999),
 (1242, 2300, 4, 77, 449900),
 (1245, 2609, 4, 5, 499998),
 (1246, 3031, 4, 21, 599000),
 (1250, 1962, 4, 53, 259900),
 (1259, 2040, 4, 75, 314900),
 (1261, 1811, 4, 24, 285900),
 (1264, 2132, 4, 28, 345000),
 (1265, 4215, 4, 66, 549000),
 (1266, 2162, 4, 43, 287000),
 (1269, 2567, 4, 57, 314000),
 (1272, 1852, 4, 64, 299900),
 (1278, 3000, 4, 75, 539900),
 (1279, 1985, 4, 61, 299900),
 (1284, 1940, 4, 7, 239999),
 (1289, 2300, 4, 77, 449900),
 (1292, 2609, 4, 5, 499998),
 (1293, 3031, 4, 21, 599000),
 (1297, 1962, 4, 53, 259900),
 (1306, 2040, 4, 75, 314900),
 (1308, 1811, 4, 24, 285900),
 (1311, 2132, 4, 28, 345000),
 (1312, 4215, 4, 66, 549000),
 (1313, 2162, 4, 43, 287000),
 (1316, 2567, 4, 57, 314000),
 (1319, 1852, 4, 64, 299900),
 (1325, 3000, 4, 75, 539900),
 (1326, 1985, 4, 61, 299900),
 (1331, 1940, 4, 7, 239999),
 (1336, 2300, 4, 77, 449900),
 (1339, 2609, 4, 5, 499998),
 (1340, 3031, 4, 21, 599000),
 (1344, 1962, 4, 53, 259900),
 (1353, 2040, 4, 75, 314900),
 (1355, 1811, 4, 24, 285900),
 (1358, 2132, 4, 28, 345000),
 (1359, 4215, 4, 66, 549000),
 (1360, 2162, 4, 43, 287000),
 (1363, 2567, 4, 57, 314000),
 (1366, 1852, 4, 64, 299900),
 (1372, 3000, 4, 75, 539900),
 (1373, 1985, 4, 61, 299900),
 (1378, 1940, 4, 7, 239999),
 (1383, 2300, 4, 77, 449900),
 (1386, 2609, 4, 5, 499998),
 (1387, 3031, 4, 21, 599000),
 (1391, 1962, 4, 53, 259900),
 (1400, 2040, 4, 75, 314900),
 (1402, 1811, 4, 24, 285900),
 (1405, 2132, 4, 28, 345000),
 (1406, 4215, 4, 66, 549000),
 (1407, 2162, 4, 43, 287000),
 (1410, 2567, 4, 57, 314000),
 (1413, 1852, 4, 64, 299900),
 (1419, 3000, 4, 75, 539900),
 (1420, 1985, 4, 61, 299900),
 (1425, 1940, 4, 7, 239999),
 (1430, 2300, 4, 77, 449900),
 (1433, 2609, 4, 5, 499998),
 (1434, 3031, 4, 21, 599000),
 (1438, 1962, 4, 53, 259900),
 (1447, 2040, 4, 75, 314900),
 (1449, 1811, 4, 24, 285900),
 (1452, 2132, 4, 28, 345000),
 (1453, 4215, 4, 66, 549000),
 (1454, 2162, 4, 43, 287000),
 (1457, 2567, 4, 57, 314000),
 (1460, 1852, 4, 64, 299900),
 (1466, 3000, 4, 75, 539900),
 (1467, 1985, 4, 61, 299900),
 (1472, 1940, 4, 7, 239999),
 (1477, 2300, 4, 77, 449900),
 (1480, 2609, 4, 5, 499998),
 (1481, 3031, 4, 21, 599000),
 (1485, 1962, 4, 53, 259900),
 (1494, 2040, 4, 75, 314900),
 (1496, 1811, 4, 24, 285900),
 (1499, 2132, 4, 28, 345000),
 (1500, 4215, 4, 66, 549000),
 (1501, 2162, 4, 43, 287000),
 (1504, 2567, 4, 57, 314000),
 (1507, 1852, 4, 64, 299900),
 (1513, 3000, 4, 75, 539900),
 (1514, 1985, 4, 61, 299900),
 (1519, 1940, 4, 7, 239999),
 (1524, 2300, 4, 77, 449900),
 (1527, 2609, 4, 5, 499998),
 (1528, 3031, 4, 21, 599000),
 (1532, 1962, 4, 53, 259900),
 (1541, 2040, 4, 75, 314900),
 (1543, 1811, 4, 24, 285900),
 (1546, 2132, 4, 28, 345000),
 (1547, 4215, 4, 66, 549000),
 (1548, 2162, 4, 43, 287000),
 (1551, 2567, 4, 57, 314000),
 (1554, 1852, 4, 64, 299900),
 (1560, 3000, 4, 75, 539900),
 (1561, 1985, 4, 61, 299900),
 (1566, 1940, 4, 7, 239999),
 (1571, 2300, 4, 77, 449900),
 (1574, 2609, 4, 5, 499998),
 (1575, 3031, 4, 21, 599000),
 (1579, 1962, 4, 53, 259900),
 (1588, 2040, 4, 75, 314900),
 (1590, 1811, 4, 24, 285900),
 (1593, 2132, 4, 28, 345000),
 (1594, 4215, 4, 66, 549000),
 (1595, 2162, 4, 43, 287000),
 (1598, 2567, 4, 57, 314000),
 (1601, 1852, 4, 64, 299900),
 (1607, 3000, 4, 75, 539900),
 (1608, 1985, 4, 61, 299900),
 (1613, 1940, 4, 7, 239999),
 (1618, 2300, 4, 77, 449900),
 (1621, 2609, 4, 5, 499998),
 (1622, 3031, 4, 21, 599000),
 (1626, 1962, 4, 53, 259900),
 (1635, 2040, 4, 75, 314900),
 (1637, 1811, 4, 24, 285900),
 (1640, 2132, 4, 28, 345000),
 (1641, 4215, 4, 66, 549000),
 (1642, 2162, 4, 43, 287000),
 (1645, 2567, 4, 57, 314000),
 (1648, 1852, 4, 64, 299900),
 (1654, 3000, 4, 75, 539900),
 (1655, 1985, 4, 61, 299900),
 (1660, 1940, 4, 7, 239999),
 (1665, 2300, 4, 77, 449900),
 (1668, 2609, 4, 5, 499998),
 (1669, 3031, 4, 21, 599000),
 (1673, 1962, 4, 53, 259900),
 (1682, 2040, 4, 75, 314900),
 (1684, 1811, 4, 24, 285900),
 (1687, 2132, 4, 28, 345000),
 (1688, 4215, 4, 66, 549000),
 (1689, 2162, 4, 43, 287000),
 (1692, 2567, 4, 57, 314000),
 (1695, 1852, 4, 64, 299900),
 (1701, 3000, 4, 75, 539900),
 (1702, 1985, 4, 61, 299900),
 (1707, 1940, 4, 7, 239999),
 (1712, 2300, 4, 77, 449900),
 (1715, 2609, 4, 5, 499998),
 (1716, 3031, 4, 21, 599000),
 (1720, 1962, 4, 53, 259900),
 (1729, 2040, 4, 75, 314900),
 (1731, 1811, 4, 24, 285900),
 (1734, 2132, 4, 28, 345000),
 (1735, 4215, 4, 66, 549000),
 (1736, 2162, 4, 43, 287000),
 (1739, 2567, 4, 57, 314000),
 (1742, 1852, 4, 64, 299900),
 (1748, 3000, 4, 75, 539900),
 (1749, 1985, 4, 61, 299900),
 (1754, 1940, 4, 7, 239999),
 (1759, 2300, 4, 77, 449900),
 (1762, 2609, 4, 5, 499998),
 (1763, 3031, 4, 21, 599000),
 (1767, 1962, 4, 53, 259900),
 (1776, 2040, 4, 75, 314900),
 (1778, 1811, 4, 24, 285900),
 (1781, 2132, 4, 28, 345000),
 (1782, 4215, 4, 66, 549000),
 (1783, 2162, 4, 43, 287000),
 (1786, 2567, 4, 57, 314000),
 (1789, 1852, 4, 64, 299900),
 (1795, 3000, 4, 75, 539900),
 (1796, 1985, 4, 61, 299900),
 (1801, 1940, 4, 7, 239999),
 (1806, 2300, 4, 77, 449900),
 (1809, 2609, 4, 5, 499998),
 (1810, 3031, 4, 21, 599000),
 (1814, 1962, 4, 53, 259900),
 (1823, 2040, 4, 75, 314900),
 (1825, 1811, 4, 24, 285900),
 (1828, 2132, 4, 28, 345000),
 (1829, 4215, 4, 66, 549000),
 (1830, 2162, 4, 43, 287000),
 (1833, 2567, 4, 57, 314000),
 (1836, 1852, 4, 64, 299900),
 (1842, 3000, 4, 75, 539900),
 (1843, 1985, 4, 61, 299900),
 (1848, 1940, 4, 7, 239999),
 (1853, 2300, 4, 77, 449900),
 (1856, 2609, 4, 5, 499998),
 (1857, 3031, 4, 21, 599000),
 (1861, 1962, 4, 53, 259900),
 (1870, 2040, 4, 75, 314900),
 (1872, 1811, 4, 24, 285900),
 (1875, 2132, 4, 28, 345000),
 (1876, 4215, 4, 66, 549000),
 (1877, 2162, 4, 43, 287000),
 (1880, 2567, 4, 57, 314000),
 (1883, 1852, 4, 64, 299900),
 (1889, 3000, 4, 75, 539900),
 (1890, 1985, 4, 61, 299900),
 (1895, 1940, 4, 7, 239999),
 (1900, 2300, 4, 77, 449900),
 (1903, 2609, 4, 5, 499998),
 (1904, 3031, 4, 21, 599000),
 (1908, 1962, 4, 53, 259900),
 (1917, 2040, 4, 75, 314900),
 (1919, 1811, 4, 24, 285900),
 (1922, 2132, 4, 28, 345000),
 (1923, 4215, 4, 66, 549000),
 (1924, 2162, 4, 43, 287000),
 (1927, 2567, 4, 57, 314000),
 (1930, 1852, 4, 64, 299900),
 (1936, 3000, 4, 75, 539900),
 (1937, 1985, 4, 61, 299900),
 (1942, 1940, 4, 7, 239999),
 (1947, 2300, 4, 77, 449900),
 (1950, 2609, 4, 5, 499998),
 (1951, 3031, 4, 21, 599000),
 (1955, 1962, 4, 53, 259900),
 (1964, 2040, 4, 75, 314900),
 (1966, 1811, 4, 24, 285900),
 (1969, 2132, 4, 28, 345000),
 (1970, 4215, 4, 66, 549000),
 (1971, 2162, 4, 43, 287000),
 (1974, 2567, 4, 57, 314000),
 (1977, 1852, 4, 64, 299900),
 (1983, 3000, 4, 75, 539900),
 (1984, 1985, 4, 61, 299900),
 (1989, 1940, 4, 7, 239999),
 (1994, 2300, 4, 77, 449900),
 (1997, 2609, 4, 5, 499998),
 (1998, 3031, 4, 21, 599000),
 (2002, 1962, 4, 53, 259900),
 (2011, 2040, 4, 75, 314900),
 (2013, 1811, 4, 24, 285900),
 (2016, 2132, 4, 28, 345000),
 (2017, 4215, 4, 66, 549000),
 (2018, 2162, 4, 43, 287000),
 (2021, 2567, 4, 57, 314000),
 (2024, 1852, 4, 64, 299900),
 (2030, 3000, 4, 75, 539900),
 (2031, 1985, 4, 61, 299900),
 (2036, 1940, 4, 7, 239999),
 (2041, 2300, 4, 77, 449900),
 (2044, 2609, 4, 5, 499998),
 (2045, 3031, 4, 21, 599000),
 (2049, 1962, 4, 53, 259900),
 (2058, 2040, 4, 75, 314900),
 (2060, 1811, 4, 24, 285900),
 (2063, 2132, 4, 28, 345000),
 (2064, 4215, 4, 66, 549000),
 (2065, 2162, 4, 43, 287000),
 (2068, 2567, 4, 57, 314000),
 (2071, 1852, 4, 64, 299900),
 (2077, 3000, 4, 75, 539900),
 (2078, 1985, 4, 61, 299900),
 (2083, 1940, 4, 7, 239999),
 (2088, 2300, 4, 77, 449900),
 (2091, 2609, 4, 5, 499998),
 (2092, 3031, 4, 21, 599000),
 (2096, 1962, 4, 53, 259900),
 (2105, 2040, 4, 75, 314900),
 (2107, 1811, 4, 24, 285900),
 (2110, 2132, 4, 28, 345000),
 (2111, 4215, 4, 66, 549000),
 (2112, 2162, 4, 43, 287000),
 (2115, 2567, 4, 57, 314000),
 (2118, 1852, 4, 64, 299900),
 (2124, 3000, 4, 75, 539900),
 (2125, 1985, 4, 61, 299900),
 (2130, 1940, 4, 7, 239999),
 (2135, 2300, 4, 77, 449900),
 (2138, 2609, 4, 5, 499998),
 (2139, 3031, 4, 21, 599000),
 (2143, 1962, 4, 53, 259900),
 (2152, 2040, 4, 75, 314900),
 (2154, 1811, 4, 24, 285900),
 (2157, 2132, 4, 28, 345000),
 (2158, 4215, 4, 66, 549000),
 (2159, 2162, 4, 43, 287000),
 (2162, 2567, 4, 57, 314000),
 (2165, 1852, 4, 64, 299900),
 (2171, 3000, 4, 75, 539900),
 (2172, 1985, 4, 61, 299900),
 (2177, 1940, 4, 7, 239999),
 (2182, 2300, 4, 77, 449900),
 (2185, 2609, 4, 5, 499998),
 (2186, 3031, 4, 21, 599000),
 (2190, 1962, 4, 53, 259900),
 (2199, 2040, 4, 75, 314900),
 (2201, 1811, 4, 24, 285900),
 (2204, 2132, 4, 28, 345000),
 (2205, 4215, 4, 66, 549000),
 (2206, 2162, 4, 43, 287000),
 (2209, 2567, 4, 57, 314000),
 (2212, 1852, 4, 64, 299900)]

**2. Run a query to calculate the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [64]:
# ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1837.937074829932, 326192.862244898),
 (4, 2400.412746585736, 377361.09104704094),
 (5, 4468.041666666667, 698214.5833333334)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [65]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database. 

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [67]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv('housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [78]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

Run a query to get the average price of each house size from this table:

In [81]:
#ANSWER

c.execute('SELECT bdrms, AVG (price) FROM houses_pandas GROUP BY bdrms').fetchall()

[(1, 169900.0),
 (2, 280866.6666666667),
 (3, 326403.92),
 (4, 377449.78571428574),
 (5, 699900.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database? 

ANS - when there are advanced manipulations which i would like to do.

2. When would you want to use Pandas on a dataset retrieved from a database?

ANS - when there are advanced manipulations other than the basic operators available in sql which i would like to do

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate funtions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [82]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [197]:
# Reading CSV to Dataframe
orders = pd.read_csv('P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv('P12-OrderBreakdown.csv', encoding = 'utf-8')

In [198]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [85]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45.0,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854.0,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140.0,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27.0,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17.0,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [86]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]

In [87]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]

#### 3. Check DataTypes

In [88]:
# ANSWER
orders.dtypes

order_id         object
order_date       object
customer_name    object
country          object
dtype: object

In [89]:
# ANSWER
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
sales           float64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [91]:
# Establishing Local DB connection
db_connection = sqlite3.connect('eshop.db.sqlite')

# Save these two dataframes as a table in sqlite

orders.to_sql(name = 'orders', con = db_connection, if_exists = 'replace', index = False)
orders_break_down.to_sql(name = 'orders_break_down', con = db_connection, if_exists = 'replace', index = False)

#### 5. Select Number of Orders for Each Customer

We can use the `sql` function in `pandas.io` to run SQL queries to the database with the `.read_sql()` method. Here's an example:

In [92]:
# Select first 10 rows of all columns in orders table

query = """
        SELECT * 
        FROM orders 
        LIMIT 10;
        """

orders_head_10 = sql.read_sql(query, con=db_connection)
orders_head_10

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France
5  ES-2011-5433855  2011-01-07       Dave Poirier          France
6  IT-2011-4546695  2011-01-08      Darren Powers          France
7  ES-2011-1138719  2011-01-11       Eric Murdock           Italy
8  ES-2011-1466305  2011-01-11         Mick Brown         Austria
9  ES-2011-4359424  2011-01-11  Dorothy Dickinson           Spain

In [98]:
# Select Number of Orders for Each Customer
sql_string = '''
    SELECT 
        customer_name, 
        COUNT(order_id) AS order_count 
    FROM orders 
    GROUP BY customer_name 
    ORDER BY order_count DESC
'''

customers = sql.read_sql(sql_string, con = db_connection)
customers.head()

    customer_name  order_count
0      John Grady           13
1    Joel Jenkins           12
2  Aaron Smayling           12
3  Yoseph Carroll           11
4     Sarah Brown           11

#### 6. Select Number of Customers for Each Country

In [94]:
# Select Number of Customers for Each Country

sql_string = '''
    SELECT 
        country, 
        COUNT(DISTINCT customer_name) AS Count 
    FROM orders 
    GROUP BY country 
    ORDER BY Count DESC
'''

customers = sql.read_sql(sql_string, con = db_connection)
customers.head()

          country  Count
0          France    568
1         Germany    505
2  United Kingdom    473
3           Italy    351
4           Spain    306

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [107]:
#  Select discount, sales, quantity for Each Order from orders_break_down Table

sql_string = '''
    SELECT 
        discount, 
        sales,
        quantity
        
    FROM orders_break_down 
   
    
'''

customers = sql.read_sql(sql_string, con = db_connection)
customers.head()

   discount  sales  quantity
0       0.5   45.0         3
1       0.0  854.0         7
2       0.0  140.0         3
3       0.5   27.0         2
4       0.5   17.0         2

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [109]:
# Select discount, sales, quantity, total price for Each Order from orders_break_down Table

sql_string = '''
    SELECT 
        discount, 
        sales,
        quantity, 
        sales*quantity-discount AS total_price
        
    FROM orders_break_down 
   
    
'''

customers = sql.read_sql(sql_string, con = db_connection)
customers.head()

   discount  sales  quantity  total_price
0       0.5   45.0         3        134.5
1       0.0  854.0         7       5978.0
2       0.0  140.0         3        420.0
3       0.5   27.0         2         53.5
4       0.5   17.0         2         33.5

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [116]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100


sql_string = '''
    SELECT 
        *
        , (sales * quantity - discount) AS total_price
    FROM orders_break_down 
    WHERE total_price > 100
    ORDER BY total_price ASC

'''

customers = sql.read_sql(sql_string, con = db_connection)
customers.head(10)

,order_id,product_name,discount,sales,quantity,category,total_price
0,IT-2011-2668777,"Binney & Smith Canvas, Blue",0.5,51.0,2,Office Supplies,101.5
1,IT-2011-1165265,"Cardinal Binding Machine, Durable",0.5,51.0,2,Office Supplies,101.5
2,ES-2012-1763830,"Elite Scissors, High Speed",0.5,34.0,3,Office Supplies,101.5
3,IT-2012-4099397,"Sanford Canvas, Blue",0.5,51.0,2,Office Supplies,101.5
4,ES-2013-4250046,"Cardinal Binding Machine, Durable",0.5,51.0,2,Office Supplies,101.5
5,ES-2014-5784412,"Okidata Calculator, White",0.5,51.0,2,Technology,101.5
6,IT-2014-5393609,"Tenex Lockers, Single Width",0.5,102.0,1,Office Supplies,101.5
7,ES-2012-5499117,"Fellowes Box, Wire Frame",0.4,34.0,3,Office Supplies,101.6
8,ES-2014-3096832,"Fellowes Box, Wire Frame",0.4,34.0,3,Office Supplies,101.6
9,ES-2011-4665208,"Avery Binder Covers, Durable",0.1,34.0,3,Office Supplies,101.9

#### 8. Select All Customer And The Product They Have Bought

In [121]:
# Select All Customer And The Product They Have Bought

sql_string = '''
    SELECT 
        orders.order_id
        , orders.customer_name
        , orders_break_down.product_name
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
''' 
customers = sql.read_sql(sql_string, con = db_connection)
customers.head()

          order_id      customer_name                           product_name
0  IT-2011-3647632       Eugene Moren            Enermax Note Cards, Premium
1  ES-2011-4869686  Dorothy Dickinson     Dania Corner Shelving, Traditional
2  ES-2011-4939443     Arthur Prichep  Binney & Smith Sketch Pad, Easy-Erase
3  IT-2011-2942451     Grant Thornton             Boston Markers, Easy-Erase
4  IT-2011-2942451     Grant Thornton            Eldon Folders, Single Width

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [137]:
# Select Number of 'Furniture' Orders For Each Country


sql_string = '''
    SELECT 
        orders.country
        , COUNT(orders_break_down.order_id) AS Count           
    FROM orders
    JOIN orders_break_down
    ON orders.order_id = orders_break_down.order_id
    WHERE orders_break_down.category = 'Furniture'
    GROUP BY orders.country
'''

order_list = sql.read_sql(sql_string, con = db_connection)

order_list.head()

   country  Count
0  Austria     40
1  Belgium     20
2  Denmark      9
3  Finland     16
4   France    299

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [141]:
# Select Number of 'Furniture' Orders For The Country Denmark


sql_string = '''
    SELECT 
        COUNT(orders_break_down.order_id) AS Count           
    FROM orders
    JOIN orders_break_down
    ON orders.order_id = orders_break_down.order_id
    WHERE orders_break_down.category = 'Furniture'
    AND orders.country = 'Denmark'
    
'''

order_list = sql.read_sql(sql_string, con = db_connection)

order_list.head()

   Count
0      9

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [168]:
# Select Total Sales With Discount and Without Discount for Each Country



sql_string = '''
    SELECT 
    orders.country,orders_break_down.discount,
        SUM(orders_break_down.sales)  AS total_sales     
    FROM orders_break_down
    JOIN orders
    ON orders.order_id = orders_break_down.order_id
           GROUP BY orders_break_down.discount
'''

order_list = sql.read_sql(sql_string, con = db_connection)

order_list.head()

          country  discount  total_sales
0  United Kingdom      0.00    1232868.0
1          France      0.10     572657.0
2          France      0.15     191864.0
3           Spain      0.20      36842.0
4  United Kingdom      0.30       4952.0

#### 11.A Select Total Quantity, Total Sales for Each Country

In [147]:
# Select Total Quantity, Total Sales for Each Country


sql_string = '''
    SELECT
        orders.country
        , SUM(sales) AS total_sales
        , SUM(quantity) AS total_quantity       
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
    GROUP BY orders.country
'''

order_list = sql.read_sql(sql_string, con = db_connection)

order_list.head()

   country  total_sales  total_quantity
0  Austria      79382.0             973
1  Belgium      42320.0             532
2  Denmark       7763.0             204
3  Finland      20702.0             201
4   France     609683.0            7329

#### 11.B Select Top 3 Country Based on Sales

In [170]:
# Select Top 3 Country Based on Sales


order_list.head(3)

          country  discount  total_sales
0  United Kingdom      0.00    1232868.0
1          France      0.10     572657.0
2          France      0.15     191864.0

#### 11.C Select Bottom 3 Country Based On Quantities

In [171]:
# Select Bottom 3 Country Based On Quantities

order_list.tail(3)

           country  discount  total_sales
11     Netherlands      0.70       3658.0
12  United Kingdom      0.80        139.0
13         Germany      0.85        555.0

#### 12. Select Average Sales By Categroy For The Country 'France'

In [187]:
# Select Average Sales By Categroy For The Country 'France'


sql_string = '''
    SELECT
        orders.country,
        orders_break_down.category,
        AVG(sales) AS avg_sales
              
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
   WHERE orders.country = 'France'
   GROUP BY orders_break_down.category
'''

sales_list = sql.read_sql(sql_string, con = db_connection)

sales_list.head()

  country         category   avg_sales
0  France        Furniture  582.314381
1  France  Office Supplies  167.217709
2  France       Technology  595.145078

#### 13. Select Country, Category and Total Sales Where Average Total Sales is The Highest

In [205]:
# Select Country, Category and Total Sales Where Average Total Sales is The Highest



sql_string = '''
    SELECT
        orders.country,
        orders_break_down.category,
        SUM(orders_break_down.sales) AS total_sales
              
    FROM orders
    JOIN orders_break_down ON orders.order_id = orders_break_down.order_id
   
   
'''

sales_list = sql.read_sql(sql_string, con = db_connection)

sales_list.head(1)

  country         category  total_sales
0  Sweden  Office Supplies    2348482.0

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams. 
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)  
- [SQL zoo](http://www.sqlzoo.net)  Great for learning syntax



---



---



> > > > > > > > > © 2019 Institute of Data


---



---